var store = [{
        "title": "[혼공자바] 1주차 과제",
        "excerpt":"1. JDK 설치화면 인증하기 (기본미션) 2. p.88 확인문제 9번 (선택미션) 1. public class Main { public static void main(String[] args) { long var1 = 2L; float var2 = 1.8f; double var3 = 2.5; String var4 = \"3.9\"; int result = (int)var1 + (int)var2 + (int)(var3 + Float.parseFloat(var4)); System.out.println(result); } }...","categories": ["혼공자바"],
        "tags": ["Java","혼공자바","혼공자바 연습문제","혼공학습단 11기"],
        "url": "/%ED%98%BC%EA%B3%B5%EC%9E%90%EB%B0%94/1.week1/",
        "teaser": null
      },{
        "title": "[혼공컴운] 1주차 미션",
        "excerpt":"1. P.51, 65 확인 문제 3번 풀고 인증하기(기본 미션) 프로그램이 실행되려면 반드시 (메모리)에 저장되어 있어야 합니다. 1101 ➡️ 0010 ➡️ 0011 1101(2)을 음수로 표현한 값은 0011입니다. 2. P100. 스택과 큐의 개념을 정리하기(선택미션) 1. 스택 한쪽 끝이 막혀 있는 저장 공간 LIFO : 후입선출 방식 PUSH : 스택에 새로운 데이터를 저장하는...","categories": ["혼공컴운"],
        "tags": ["컴퓨터구조","운영체제","혼공컴운 연습문제","혼공학습단 11기"],
        "url": "/%ED%98%BC%EA%B3%B5%EC%BB%B4%EC%9A%B4/1.week1-CO/",
        "teaser": null
      },{
        "title": "[혼공컴운] Ch01 정리",
        "excerpt":"1. 컴퓨터 구조를 알아야 하는 이유 문제 상황을 빠르게 진단할 수 있다. 문제 해결의 실마리를 다양하게 찾을 수 있다. 문법만으로 알기 어려운 성능/용량/비용을 고려하며 개발할 수 있다. 컴퓨터 구조를 이해하면 우리는 컴퓨터를 미지의 대상에서 분석의 대상으로 인식할 수 있다. 2. 컴퓨터 구조의 큰 그림 우리가 알아야 하는 컴퓨터 구조 지식은...","categories": ["혼공컴운"],
        "tags": ["컴퓨터구조","운영체제","혼공컴운 연습문제","혼공학습단 11기"],
        "url": "/%ED%98%BC%EA%B3%B5%EC%BB%B4%EC%9A%B4/Ch01/",
        "teaser": null
      },{
        "title": "[혼공컴운] Ch02 정리",
        "excerpt":"1. 0과 1로 숫자를 표현하는 방법 1.정보단위 비트(bit) : 0과 1을 나타내는 가장 정보 단위 n비트는 가지 정보를 표현할 수 있다. 바이트(byte) : 여덟 개의 비트를 묶은 단위 1바이트(1byte) = 8비트(8bit) 1킬로바이트(1kB) = 1,000바이트(1,000byte) 1메가바이트(1MB) = 1,000킬로바이트(1,000kB) 1기가바이트(1GB) = 1,000메가바이트(1,000MB) 1테라바이트(1TB) = 1,000기가바이트(1,000GB) ✔️ 1kB = 1,024byte, 1MB = 1,024kB.....","categories": ["혼공컴운"],
        "tags": ["컴퓨터구조","운영체제","혼공컴운 연습문제","혼공학습단 11기"],
        "url": "/%ED%98%BC%EA%B3%B5%EC%BB%B4%EC%9A%B4/Ch02/",
        "teaser": null
      }]
